public class ForLoopLecture {
  public static void main (String[] args) {
    // ()内の3つが大切.（① カウント変数宣言; ② 繰り返し条件式; ③ 閉じカッコの処理）となっている.
    for(int i = 0; i < 10 ; i++) {
      int n = i + 1;
      System.out.println("繰り返し：" + n + "周め");
    }
  }
}

  // 「繰り返し：１周目」〜「繰り返し：１０周目」まで表示される.

  // for文の仕組み
  // ① カウント変数宣言 の処理は最初の１周目のみ行われる.
  // ② 繰り返し条件式　の判定結果がtrueのとき：{ }内の処理を行う
  // 　　falseのとき：{ }内の処理をスキップして{ }の下段へ.
  // ③ 閉じカッコの処理
  // →「for() { } の　閉じかっこ "}" まで処理が進んだとき、次にやりたいこと」を記述.

  // ２周目以降は、再度「②繰り返し条件式」を実行して、繰り返しをするかしないか？を判定する.
  // 「①カウント変数宣言」は実行しないことに注意.

